Revit 2027 API
ExtendedPropertiesLinkLoadContent.SetExtendedPropertiesLinkData Method
 Sets the extended properties data from the external server.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExtendedPropertiesLinkData(
	ExtendedPropertiesLinkData data
)
Public Sub SetExtendedPropertiesLinkData (
	data As ExtendedPropertiesLinkData
)
public:
void SetExtendedPropertiesLinkData(
	ExtendedPropertiesLinkData^ data
)
member SetExtendedPropertiesLinkData :
        data : ExtendedPropertiesLinkData -> unit
Parameters
data ExtendedPropertiesLinkData
 The extended properties data to set.
Exceptions
Exception | Condition
ArgumentException |  The extended properties data does not contain a valid container name.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkLoadContent Class
Autodesk.Revit.DB.ExternalData Namespace